In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
s1 = pd.Series([1,2,3,4,5])
s2  = pd.Series((1,2,3,4,5))
print(s1,s2)

0    1
1    2
2    3
3    4
4    5
dtype: int64 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
s2 = pd.Series((1,2,3,4,5), index=['A','B','C','D','E'], name="Series")
s2.index.name = 'ID'
print(s1,s2, sep='\n\n')

0    1
1    2
2    3
3    4
4    5
dtype: int64

ID
A    1
B    2
C    3
D    4
E    5
Name: Series, dtype: int64

In [6]:
di = {'A':22,'B':11,'C':3,'D':7,'E':13}
s3 = pd.Series(di)

In [7]:
print(s3)

A    22
B    11
C     3
D     7
E    13
dtype: int64

In [8]:
data = [[1,'Arslan','AIC',1500],
       [2,'Tariq','AIC',1500],
       [3,'Tariq','WD',1500],
       [4,'Arslan','QCC',1500]]

In [9]:
data

[[1, 'Arslan', 'AIC', 1500],
 [2, 'Tariq', 'AIC', 1500],
 [3, 'Tariq', 'WD', 1500],
 [4, 'Arslan', 'QCC', 1500]]

In [10]:
type(data)

list

In [11]:
df1 = pd.DataFrame(data)

In [12]:
df1

   0       1    2     3
0  1  Arslan  AIC  1500
1  2   Tariq  AIC  1500
2  3   Tariq   WD  1500
3  4  Arslan  QCC  1500

In [13]:
df1 = pd.DataFrame(data, columns=['ID','Name','Course','Fee'], index=range(1,5))
df1

   ID    Name Course   Fee
1   1  Arslan    AIC  1500
2   2   Tariq    AIC  1500
3   3   Tariq     WD  1500
4   4  Arslan    QCC  1500

In [14]:
lt = [(1,'Arslan','AIC',1500),
(2,'Abrar','BCC',1500),
(3,'Tariq','AIC',1500),
(4,'Arslan','QCC',1500)]

In [15]:
lt

[(1, 'Arslan', 'AIC', 1500),
 (2, 'Abrar', 'BCC', 1500),
 (3, 'Tariq', 'AIC', 1500),
 (4, 'Arslan', 'QCC', 1500)]

In [17]:
df2 = pd.DataFrame(lt, columns =['ID','Name','Course','Fee'], index=['A','B','C','D'])
df2

   ID    Name Course   Fee
A   1  Arslan    AIC  1500
B   2   Abrar    BCC  1500
C   3   Tariq    AIC  1500
D   4  Arslan    QCC  1500

In [5]:
d1 = {'ID':[1,2,3,3,4],'Name':['Arslan','Abrar','Tariq','Tariq','Usman'],'Course':['QCC',np.nan,'AIC','CNC','AIOT'],'Fee':[1500,1500,1500,1500,1500,]}

In [6]:
df3 = pd.DataFrame(d1)

In [7]:
df3

   ID    Name Course   Fee
0   1  Arslan    QCC  1500
1   2   Abrar    NaN  1500
2   3   Tariq    AIC  1500
3   3   Tariq    CNC  1500
4   4   Usman   AIOT  1500

In [24]:
df4 = pd.DataFrame(
np.random.randint(1,100, size=(100,5)),
    columns = ['A','B','C','D','E']
)

In [26]:
df4.head(4)

    A   B   C   D   E
0  23   8  30  90   9
1  40  90  27  77   7
2  60  49  94  25  73
3  43  76  86  51  59

In [27]:
d2 = {'A':pd.Series([1,3,4,5]),
     'C': pd.Series([1,3,5,2])}
df5 = pd.DataFrame(d2)

In [28]:
df5

   A  C
0  1  1
1  3  3
2  4  5
3  5  2

In [30]:
d3 = {'A':{'ID':1,'Name':'Tariq'},'B':{'ID':2,"Name":"Arslan"}}
df6 = pd.DataFrame(d3)
print(df6)

          A       B
ID        1       2
Name  Tariq  Arslan

In [31]:
li = [{"Name":'Tariq',"Course":'AIC'},
     {'Name':"Arslan",'Course':'QCC'},
     {'Name':'Abrar','Course':'BCC'}]

In [32]:
li

[{'Name': 'Tariq', 'Course': 'AIC'},
 {'Name': 'Arslan', 'Course': 'QCC'},
 {'Name': 'Abrar', 'Course': 'BCC'}]

In [33]:
df7 = pd.DataFrame(li)

In [34]:
df7

     Name Course
0   Tariq    AIC
1  Arslan    QCC
2   Abrar    BCC

In [35]:
df1

   ID    Name Course   Fee
1   1  Arslan    AIC  1500
2   2   Tariq    AIC  1500
3   3   Tariq     WD  1500
4   4  Arslan    QCC  1500

In [36]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 1 to 4
Data columns (total 4 columns):
ID        4 non-null int64
Name      4 non-null object
Course    4 non-null object
Fee       4 non-null int64
dtypes: int64(2), object(2)
memory usage: 260.0+ bytes

In [37]:
df1.describe()

             ID     Fee
count  4.000000     4.0
mean   2.500000  1500.0
std    1.290994     0.0
min    1.000000  1500.0
25%    1.750000  1500.0
50%    2.500000  1500.0
75%    3.250000  1500.0
max    4.000000  1500.0

In [38]:
df1.dtypes

ID         int64
Name      object
Course    object
Fee        int64
dtype: object

In [39]:
df1.columns

Index(['ID', 'Name', 'Course', 'Fee'], dtype='object')

In [40]:
df1.index

RangeIndex(start=1, stop=5, step=1)

In [41]:
df1.values

array([[1, 'Arslan', 'AIC', 1500],
       [2, 'Tariq', 'AIC', 1500],
       [3, 'Tariq', 'WD', 1500],
       [4, 'Arslan', 'QCC', 1500]], dtype=object)

In [43]:
df8 = pd.DataFrame(d1)

In [44]:
df8

   ID    Name Course   Fee
0   1  Arslan    QCC  1500
1   2   Abrar    NaN  1500
2   3   Tariq    AIC  1500
3   3   Tariq    CNC  1500
4   4   Usman   AIOT  1500

In [45]:
df8.isnull()

      ID   Name  Course    Fee
0  False  False   False  False
1  False  False    True  False
2  False  False   False  False
3  False  False   False  False
4  False  False   False  False

In [46]:
df8.count()

ID        5
Name      5
Course    4
Fee       5
dtype: int64

In [48]:
df8.isnull().sum()

ID        0
Name      0
Course    1
Fee       0
dtype: int64

In [49]:
df8.isnull().count()

ID        5
Name      5
Course    5
Fee       5
dtype: int64

In [50]:
df8

   ID    Name Course   Fee
0   1  Arslan    QCC  1500
1   2   Abrar    NaN  1500
2   3   Tariq    AIC  1500
3   3   Tariq    CNC  1500
4   4   Usman   AIOT  1500

In [51]:
df8.count()

ID        5
Name      5
Course    4
Fee       5
dtype: int64

In [53]:
df8.notnull().sum()

ID        5
Name      5
Course    4
Fee       5
dtype: int64

In [54]:
df8.head(2)

   ID    Name Course   Fee
0   1  Arslan    QCC  1500
1   2   Abrar    NaN  1500

In [55]:
df8.tail(2)

   ID   Name Course   Fee
3   3  Tariq    CNC  1500
4   4  Usman   AIOT  1500

In [57]:
df8.head()

   ID    Name Course   Fee
0   1  Arslan    QCC  1500
1   2   Abrar    NaN  1500
2   3   Tariq    AIC  1500
3   3   Tariq    CNC  1500
4   4   Usman   AIOT  1500

In [58]:
df8.sum()

ID                              13
Name    ArslanAbrarTariqTariqUsman
Fee                           7500
dtype: object

In [59]:
df8.sum(axis=1)

0    1501
1    1502
2    1503
3    1503
4    1504
dtype: int64

In [60]:
df8.sum()[['ID','Fee']]

ID       13
Fee    7500
dtype: object

In [62]:
df8.max()

ID          4
Name    Usman
Fee      1500
dtype: object

In [63]:
df8.min()

ID          1
Name    Abrar
Fee      1500
dtype: object

In [64]:
df8

   ID    Name Course   Fee
0   1  Arslan    QCC  1500
1   2   Abrar    NaN  1500
2   3   Tariq    AIC  1500
3   3   Tariq    CNC  1500
4   4   Usman   AIOT  1500

In [65]:
df8

   ID    Name Course   Fee
0   1  Arslan    QCC  1500
1   2   Abrar    NaN  1500
2   3   Tariq    AIC  1500
3   3   Tariq    CNC  1500
4   4   Usman   AIOT  1500

In [66]:
df1

   ID    Name Course   Fee
1   1  Arslan    AIC  1500
2   2   Tariq    AIC  1500
3   3   Tariq     WD  1500
4   4  Arslan    QCC  1500

In [67]:
df1.Name

1    Arslan
2     Tariq
3     Tariq
4    Arslan
Name: Name, dtype: object

In [68]:
df1.Fee

1    1500
2    1500
3    1500
4    1500
Name: Fee, dtype: int64

In [69]:
df1['Course']

1    AIC
2    AIC
3     WD
4    QCC
Name: Course, dtype: object

In [70]:
df1['Current Status'] =0

In [71]:
df1

   ID    Name Course   Fee  Current Status
1   1  Arslan    AIC  1500               0
2   2   Tariq    AIC  1500               0
3   3   Tariq     WD  1500               0
4   4  Arslan    QCC  1500               0

In [72]:
df1.Fee.unique()

array([1500], dtype=int64)

In [73]:
df1.Course.unique()

array(['AIC', 'WD', 'QCC'], dtype=object)

In [74]:
df1.Name.unique()

array(['Arslan', 'Tariq'], dtype=object)

In [76]:
df1.Course.value_counts()

AIC    2
QCC    1
WD     1
Name: Course, dtype: int64

In [77]:
df1

   ID    Name Course   Fee  Current Status
1   1  Arslan    AIC  1500               0
2   2   Tariq    AIC  1500               0
3   3   Tariq     WD  1500               0
4   4  Arslan    QCC  1500               0

In [78]:
md = {'AIC':1, 
     'WD':2,
      'QCC':3
     }

In [79]:
df1.Course.map(md)

1    1
2    1
3    2
4    3
Name: Course, dtype: int64

In [81]:
dm2 = {}
for i,v in enumerate(df1.Course):
    dm2[i] = v
dm2

{0: 'AIC', 1: 'AIC', 2: 'WD', 3: 'QCC'}

In [82]:
df1.Course.map(dm2)

1    NaN
2    NaN
3    NaN
4    NaN
Name: Course, dtype: object

In [ ]:
df1['Course Updated'] = dm2

In [83]:
dm2

{0: 'AIC', 1: 'AIC', 2: 'WD', 3: 'QCC'}

In [84]:
df1.Course

1    AIC
2    AIC
3     WD
4    QCC
Name: Course, dtype: object

In [85]:
df1.Course.map(dm2)

1    NaN
2    NaN
3    NaN
4    NaN
Name: Course, dtype: object

In [86]:
df1

   ID    Name Course   Fee  Current Status
1   1  Arslan    AIC  1500               0
2   2   Tariq    AIC  1500               0
3   3   Tariq     WD  1500               0
4   4  Arslan    QCC  1500               0

In [87]:
df1['Course'].map(dm2)

1    NaN
2    NaN
3    NaN
4    NaN
Name: Course, dtype: object

In [88]:
df1.columns

Index(['ID', 'Name', 'Course', 'Fee', 'Current Status'], dtype='object')

In [89]:
df1['Updated Course'] = df1.Course.map(dm2)

In [90]:
df1

   ID    Name Course   Fee  Current Status Updated Course
1   1  Arslan    AIC  1500               0            NaN
2   2   Tariq    AIC  1500               0            NaN
3   3   Tariq     WD  1500               0            NaN
4   4  Arslan    QCC  1500               0            NaN

In [91]:
dm2

{0: 'AIC', 1: 'AIC', 2: 'WD', 3: 'QCC'}

In [92]:
df1.index = [1,2,3,4]

In [95]:
df1.Course.map(dm2)

1    NaN
2    NaN
3    NaN
4    NaN
Name: Course, dtype: object

In [96]:
type(dm2)

dict

In [97]:
df1.Course.map(dm2)

1    NaN
2    NaN
3    NaN
4    NaN
Name: Course, dtype: object

In [98]:
df1

   ID    Name Course   Fee  Current Status Updated Course
1   1  Arslan    AIC  1500               0            NaN
2   2   Tariq    AIC  1500               0            NaN
3   3   Tariq     WD  1500               0            NaN
4   4  Arslan    QCC  1500               0            NaN

In [99]:
di = {'AIC':1, 'WD':2, 'QCC':3}

In [100]:
df1.Course.map(di)

1    1
2    1
3    2
4    3
Name: Course, dtype: int64

In [102]:
df1.Course.map(dict(dm2))

1    NaN
2    NaN
3    NaN
4    NaN
Name: Course, dtype: object

In [103]:
dm2

{0: 'AIC', 1: 'AIC', 2: 'WD', 3: 'QCC'}

In [107]:
dm2 = {}
for i,v in enumerate(df1.Course.unique()):
    dm2[v] = i

In [108]:
dm2

{'AIC': 0, 'WD': 1, 'QCC': 2}

In [109]:
df1.Course.map(dm2)

1    0
2    0
3    1
4    2
Name: Course, dtype: int64

In [110]:
df1

   ID    Name Course   Fee  Current Status Updated Course
1   1  Arslan    AIC  1500               0            NaN
2   2   Tariq    AIC  1500               0            NaN
3   3   Tariq     WD  1500               0            NaN
4   4  Arslan    QCC  1500               0            NaN

In [111]:
df1['Updated Course'] = df1.Course.map(dm2)

In [112]:
df1

   ID    Name Course   Fee  Current Status  Updated Course
1   1  Arslan    AIC  1500               0               0
2   2   Tariq    AIC  1500               0               0
3   3   Tariq     WD  1500               0               1
4   4  Arslan    QCC  1500               0               2

In [113]:
dm2

{'AIC': 0, 'WD': 1, 'QCC': 2}

In [115]:
def course(x):
    if x=='AIC':
        return 1500
    elif x == 'QCC':
        return 3000
    elif x == 'WD':
        return 1000
    else:
        return 0
df1.Course.apply(course)

1    1500
2    1500
3    1000
4    3000
Name: Course, dtype: int64

In [116]:
df1

   ID    Name Course   Fee  Current Status  Updated Course
1   1  Arslan    AIC  1500               0               0
2   2   Tariq    AIC  1500               0               0
3   3   Tariq     WD  1500               0               1
4   4  Arslan    QCC  1500               0               2

In [117]:
df1['Updated Fee'] = df1.Course.apply(course)

In [118]:
df1

   ID    Name Course   Fee  Current Status  Updated Course  Updated Fee
1   1  Arslan    AIC  1500               0               0         1500
2   2   Tariq    AIC  1500               0               0         1500
3   3   Tariq     WD  1500               0               1         1000
4   4  Arslan    QCC  1500               0               2         3000

In [120]:
df1.columns

Index(['ID', 'Name', 'Course', 'Fee', 'Current Status', 'Updated Course',
       'Updated Fee'],
      dtype='object')

In [123]:
df = pd.DataFrame(np.random.randint(1,100, size=(6,5)), columns=['A','B','C','D','E'])

In [124]:
df

    A   B   C   D   E
0  45   9  36  49  31
1  69  85  70   6  16
2  52  97  67  11  50
3  26  11  45  12  99
4  94  86  37  29  77
5   4  75  84  20  51

In [4]:
df1

NameError: name 'df1' is not defined

In [129]:
pd.concat([df1,df], axis=0)

C:\Users\TARYK\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

,A,B,C,Course,Current Status,D,E,Fee,ID,Name,Updated Course,Updated Fee
1,NaN,NaN,NaN,AIC,0.0,NaN,NaN,1500.0,1.0,Arslan,0.0,1500.0
2,NaN,NaN,NaN,AIC,0.0,NaN,NaN,1500.0,2.0,Tariq,0.0,1500.0
3,NaN,NaN,NaN,WD,0.0,NaN,NaN,1500.0,3.0,Tariq,1.0,1000.0
4,NaN,NaN,NaN,QCC,0.0,NaN,NaN,1500.0,4.0,Arslan,2.0,3000.0
0,45.0,9.0,36.0,NaN,NaN,49.0,31.0,NaN,NaN,NaN,NaN,NaN
1,69.0,85.0,70.0,NaN,NaN,6.0,16.0,NaN,NaN,NaN,NaN,NaN
2,52.0,97.0,67.0,NaN,NaN,11.0,50.0,NaN,NaN,NaN,NaN,NaN
3,26.0,11.0,45.0,NaN,NaN,12.0,99.0,NaN,NaN,NaN,NaN,NaN
4,94.0,86.0,37.0,NaN,NaN,29.0,77.0,NaN,NaN,NaN,NaN,NaN
5,4.0,75.0,84.0,NaN,NaN,20.0,51.0,NaN,NaN,NaN,NaN,NaN

In [131]:
pd.concat([df1,df], axis=1)

,ID,Name,Course,Fee,Current Status,Updated Course,Updated Fee,A,B,C,D,E
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,45,9,36,49,31
1,1.0,Arslan,AIC,1500.0,0.0,0.0,1500.0,69,85,70,6,16
2,2.0,Tariq,AIC,1500.0,0.0,0.0,1500.0,52,97,67,11,50
3,3.0,Tariq,WD,1500.0,0.0,1.0,1000.0,26,11,45,12,99
4,4.0,Arslan,QCC,1500.0,0.0,2.0,3000.0,94,86,37,29,77
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4,75,84,20,51

In [133]:
df['total'] = df.A + df.B + df.C + df.D + df.E

In [134]:
df

    A   B   C   D   E  total
0  45   9  36  49  31    170
1  69  85  70   6  16    246
2  52  97  67  11  50    277
3  26  11  45  12  99    193
4  94  86  37  29  77    323
5   4  75  84  20  51    234

In [135]:
df['percentage'] = (df.A + df.B + df.C + df.D + df.E)/500 *100

In [136]:
df

    A   B   C   D   E  total  percentage
0  45   9  36  49  31    170        34.0
1  69  85  70   6  16    246        49.2
2  52  97  67  11  50    277        55.4
3  26  11  45  12  99    193        38.6
4  94  86  37  29  77    323        64.6
5   4  75  84  20  51    234        46.8

In [140]:
def f(n):
    n=0
    if n < 33:
        return n+1
fa = df[['A','B','C','D','E']].apply(f)
fa

A    1
B    1
C    1
D    1
E    1
dtype: int64

In [9]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
df = pd.DataFrame(np.random.randint(1,100, size=(5,4)), columns = ['A','B','C','D'])

In [10]:
df

    A   B   C   D
0  38  88  92  94
1  11  83  87  26
2  72  98   9  78
3  35  23  94  72
4  91  61  14   3

In [8]:
df3

   ID    Name Course   Fee
0   1  Arslan    QCC  1500
1   2   Abrar    NaN  1500
2   3   Tariq    AIC  1500
3   3   Tariq    CNC  1500
4   4   Usman   AIOT  1500

In [11]:
pd.concat([df,df3], axis=0)

C:\Users\TARYK\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      A     B     C Course     D     Fee   ID    Name
0  38.0  88.0  92.0    NaN  94.0     NaN  NaN     NaN
1  11.0  83.0  87.0    NaN  26.0     NaN  NaN     NaN
2  72.0  98.0   9.0    NaN  78.0     NaN  NaN     NaN
3  35.0  23.0  94.0    NaN  72.0     NaN  NaN     NaN
4  91.0  61.0  14.0    NaN   3.0     NaN  NaN     NaN
0   NaN   NaN   NaN    QCC   NaN  1500.0  1.0  Arslan
1   NaN   NaN   NaN    NaN   NaN  1500.0  2.0   Abrar
2   NaN   NaN   NaN    AIC   NaN  1500.0  3.0   Tariq
3   NaN   NaN   NaN    CNC   NaN  1500.0  3.0   Tariq
4   NaN   NaN   NaN   AIOT   NaN  1500.0  4.0   Usman

In [12]:
dfc = pd.concat([df,df3], axis=1)

In [13]:
dfc

    A   B   C   D  ID    Name Course   Fee
0  38  88  92  94   1  Arslan    QCC  1500
1  11  83  87  26   2   Abrar    NaN  1500
2  72  98   9  78   3   Tariq    AIC  1500
3  35  23  94  72   3   Tariq    CNC  1500
4  91  61  14   3   4   Usman   AIOT  1500

In [14]:
dfc

    A   B   C   D  ID    Name Course   Fee
0  38  88  92  94   1  Arslan    QCC  1500
1  11  83  87  26   2   Abrar    NaN  1500
2  72  98   9  78   3   Tariq    AIC  1500
3  35  23  94  72   3   Tariq    CNC  1500
4  91  61  14   3   4   Usman   AIOT  1500

In [17]:
dfc['total'] = dfc.A + dfc.B + dfc.C + dfc.D
dfc['percentage'] = (dfc.A + dfc.B + dfc.C + dfc.D)/400*100

In [18]:
dfc

    A   B   C   D  ID    Name Course   Fee  total  percentage
0  38  88  92  94   1  Arslan    QCC  1500    312       78.00
1  11  83  87  26   2   Abrar    NaN  1500    207       51.75
2  72  98   9  78   3   Tariq    AIC  1500    257       64.25
3  35  23  94  72   3   Tariq    CNC  1500    224       56.00
4  91  61  14   3   4   Usman   AIOT  1500    169       42.25

In [19]:
def grade(p):
    if p>=90:
        return "A"
    elif p>=80:
        return "B"
    elif p>=70:
        return 'C'
    elif p>=60:
        return 'D'
    else:
        return "Fail"

In [20]:
dfc['grade'] = dfc.percentage.apply(grade)

In [21]:
dfc

    A   B   C   D  ID    Name Course   Fee  total  percentage grade
0  38  88  92  94   1  Arslan    QCC  1500    312       78.00     C
1  11  83  87  26   2   Abrar    NaN  1500    207       51.75  Fail
2  72  98   9  78   3   Tariq    AIC  1500    257       64.25     D
3  35  23  94  72   3   Tariq    CNC  1500    224       56.00  Fail
4  91  61  14   3   4   Usman   AIOT  1500    169       42.25  Fail

In [22]:
def uf(course, a,b,c,d):
    if course =="AIC":
        return np.array([a,b,c,d]).sum()
    elif course =="AIOT":
        return np.array([a,b,c,d]).prod()
    elif course =="CNC":
        return sum(np.array([a,b,c,d]).cumsum())

In [24]:
dfc['CheckValidation'] = dfc[['Course','A','B','C','D']].apply(lambda x:uf(*x), axis=1)

In [25]:
dfc

,A,B,C,D,ID,Name,Course,Fee,total,percentage,grade,CheckValidation
0,38,88,92,94,1,Arslan,QCC,1500,312,78.00,C,NaN
1,11,83,87,26,2,Abrar,NaN,1500,207,51.75,Fail,NaN
2,72,98,9,78,3,Tariq,AIC,1500,257,64.25,D,257.0
3,35,23,94,72,3,Tariq,CNC,1500,224,56.00,Fail,469.0
4,91,61,14,3,4,Usman,AIOT,1500,169,42.25,Fail,233142.0

In [26]:
l = [1,2,3,4]
print(*l)

1 2 3 4

In [27]:
dfc.sort_index(ascending=True)

,A,B,C,D,ID,Name,Course,Fee,total,percentage,grade,CheckValidation
0,38,88,92,94,1,Arslan,QCC,1500,312,78.00,C,NaN
1,11,83,87,26,2,Abrar,NaN,1500,207,51.75,Fail,NaN
2,72,98,9,78,3,Tariq,AIC,1500,257,64.25,D,257.0
3,35,23,94,72,3,Tariq,CNC,1500,224,56.00,Fail,469.0
4,91,61,14,3,4,Usman,AIOT,1500,169,42.25,Fail,233142.0

In [28]:
dfc.sort_index(ascending=False)

,A,B,C,D,ID,Name,Course,Fee,total,percentage,grade,CheckValidation
4,91,61,14,3,4,Usman,AIOT,1500,169,42.25,Fail,233142.0
3,35,23,94,72,3,Tariq,CNC,1500,224,56.00,Fail,469.0
2,72,98,9,78,3,Tariq,AIC,1500,257,64.25,D,257.0
1,11,83,87,26,2,Abrar,NaN,1500,207,51.75,Fail,NaN
0,38,88,92,94,1,Arslan,QCC,1500,312,78.00,C,NaN

In [29]:
dfc.sort_index(ascending= False, axis=1)

,total,percentage,grade,Name,ID,Fee,D,Course,CheckValidation,C,B,A
0,312,78.00,C,Arslan,1,1500,94,QCC,NaN,92,88,38
1,207,51.75,Fail,Abrar,2,1500,26,NaN,NaN,87,83,11
2,257,64.25,D,Tariq,3,1500,78,AIC,257.0,9,98,72
3,224,56.00,Fail,Tariq,3,1500,72,CNC,469.0,94,23,35
4,169,42.25,Fail,Usman,4,1500,3,AIOT,233142.0,14,61,91

In [32]:
dfc.sort_values('percentage', ascending=False)

,A,B,C,D,ID,Name,Course,Fee,total,percentage,grade,CheckValidation
0,38,88,92,94,1,Arslan,QCC,1500,312,78.00,C,NaN
2,72,98,9,78,3,Tariq,AIC,1500,257,64.25,D,257.0
3,35,23,94,72,3,Tariq,CNC,1500,224,56.00,Fail,469.0
1,11,83,87,26,2,Abrar,NaN,1500,207,51.75,Fail,NaN
4,91,61,14,3,4,Usman,AIOT,1500,169,42.25,Fail,233142.0

In [33]:
dfc.sort_values(by=['Course','percentage'], ascending=[True,False])

,A,B,C,D,ID,Name,Course,Fee,total,percentage,grade,CheckValidation
2,72,98,9,78,3,Tariq,AIC,1500,257,64.25,D,257.0
4,91,61,14,3,4,Usman,AIOT,1500,169,42.25,Fail,233142.0
3,35,23,94,72,3,Tariq,CNC,1500,224,56.00,Fail,469.0
0,38,88,92,94,1,Arslan,QCC,1500,312,78.00,C,NaN
1,11,83,87,26,2,Abrar,NaN,1500,207,51.75,Fail,NaN

In [35]:
dfl = pd.read_csv('./titanic/train.csv')
dfl.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [36]:
dfl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [38]:
dfl.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [39]:
dfl.groupby(['Survived','Sex']).agg(['count'])

                PassengerId Pclass  Name   Age SibSp Parch Ticket  Fare Cabin  \
                      count  count count count count count  count count count
Survived Sex
0        female          81     81    81    64    81    81     81    81     6
         male           468    468   468   360   468   468    468   468    62
1        female         233    233   233   197   233   233    233   233    91
         male           109    109   109    93   109   109    109   109    45

                Embarked
                   count
Survived Sex
0        female       81
         male        468
1        female      231
         male        109